Rocketmannnnnnn/Realtime-Operating-Systems/Assignment 2.2/CC3220S_leeg_project_orig/register_def.h
/*
 * register_def.h
 *
 * Includeert alle register definities.
 *
 *  Created on: 24 apr. 2018
 *      Author: VersD
 */

#ifndef REGISTER_DEF_H_
#define REGISTER_DEF_H_

#include "inc/asmdefs.h"
#include "inc/hw_adc.h"
#include "inc/hw_aes.h"
#include "inc/hw_apps_config.h"
#include "inc/hw_apps_rcm.h"
#include "inc/hw_camera.h"
#include "inc/hw_common_reg.h"
#include "inc/hw_des.h"
#include "inc/hw_dthe.h"
#include "inc/hw_flash_ctrl.h"
#include "inc/hw_gpio.h"
#include "inc/hw_gprcm.h"
#include "inc/hw_hib1p2.h"
#include "inc/hw_hib3p3.h"
#include "inc/hw_i2c.h"
#include "inc/hw_ints.h"
#include "inc/hw_mcasp.h"
#include "inc/hw_mcspi.h"
#include "inc/hw_memmap.h"
#include "inc/hw_mmchs.h"
#include "inc/hw_nvic.h"
#include "inc/hw_ocp_shared.h"
#include "inc/hw_shamd5.h"
#include "inc/hw_stack_die_ctrl.h"
#include "inc/hw_timer.h"
#include "inc/hw_types.h"
#include "inc/hw_uart.h"
#include "inc/hw_udma.h"
#include "inc/hw_wdt.h"

volatile int flag;

#endif /* REGISTER_DEF_H_ */
